apache/nuttx/arch/risc-v/src/hpm6000/hardware/hpm6300/hpm6300_gpio.h
/* Register addresses *******************************************************/

#define HPM_GPIOA_DI_VAL           (HPM_GPIO0_BASE + HPM_GPIOA_DI_VAL_OFFSET)
#define HPM_GPIOA_DI_SET           (HPM_GPIO0_BASE + HPM_GPIOA_DI_SET_OFFSET)
#define HPM_GPIOA_DI_CLR           (HPM_GPIO0_BASE + HPM_GPIOA_DI_CLR_OFFSET)
#define HPM_GPIOA_DI_TGL           (HPM_GPIO0_BASE + HPM_GPIOA_DI_TGL_OFFSET)
#define HPM_GPIOA_DO_VAL           (HPM_GPIO0_BASE + HPM_GPIOA_DO_VAL_OFFSET)
#define HPM_GPIOA_DO_SET           (HPM_GPIO0_BASE + HPM_GPIOA_DO_SET_OFFSET)
#define HPM_GPIOA_DO_CLR           (HPM_GPIO0_BASE + HPM_GPIOA_DO_CLR_OFFSET)
#define HPM_GPIOA_DO_TGL           (HPM_GPIO0_BASE + HPM_GPIOA_DO_TGL_OFFSET)
#define HPM_GPIOA_OE_VAL           (HPM_GPIO0_BASE + HPM_GPIOA_OE_VAL_OFFSET)
#define HPM_GPIOA_OE_SET           (HPM_GPIO0_BASE + HPM_GPIOA_OE_SET_OFFSET)
#define HPM_GPIOA_OE_CLR           (HPM_GPIO0_BASE + HPM_GPIOA_OE_CLR_OFFSET)
#define HPM_GPIOA_OE_TGL           (HPM_GPIO0_BASE + HPM_GPIOA_OE_TGL_OFFSET)
#define HPM_GPIOA_IF_VAL           (HPM_GPIO0_BASE + HPM_GPIOA_IF_VAL_OFFSET)
#define HPM_GPIOA_IF_SET           (HPM_GPIO0_BASE + HPM_GPIOA_IF_SET_OFFSET)
#define HPM_GPIOA_IF_CLR           (HPM_GPIO0_BASE + HPM_GPIOA_IF_CLR_OFFSET)
#define HPM_GPIOA_IF_TGL           (HPM_GPIO0_BASE + HPM_GPIOA_IF_TGL_OFFSET)
#define HPM_GPIOA_IE_VAL           (HPM_GPIO0_BASE + HPM_GPIOA_IE_VAL_OFFSET)
#define HPM_GPIOA_IE_SET           (HPM_GPIO0_BASE + HPM_GPIOA_IE_SET_OFFSET)
#define HPM_GPIOA_IE_CLR           (HPM_GPIO0_BASE + HPM_GPIOA_IE_CLR_OFFSET)
#define HPM_GPIOA_IE_TGL           (HPM_GPIO0_BASE + HPM_GPIOA_IE_TGL_OFFSET)
#define HPM_GPIOA_PL_VAL           (HPM_GPIO0_BASE + HPM_GPIOA_PL_VAL_OFFSET)
#define HPM_GPIOA_PL_SET           (HPM_GPIO0_BASE + HPM_GPIOA_PL_SET_OFFSET)
#define HPM_GPIOA_PL_CLR           (HPM_GPIO0_BASE + HPM_GPIOA_PL_CLR_OFFSET)
#define HPM_GPIOA_PL_TGL           (HPM_GPIO0_BASE + HPM_GPIOA_PL_TGL_OFFSET)
#define HPM_GPIOA_TP_VAL           (HPM_GPIO0_BASE + HPM_GPIOA_TP_VAL_OFFSET)
#define HPM_GPIOA_TP_SET           (HPM_GPIO0_BASE + HPM_GPIOA_TP_SET_OFFSET)
#define HPM_GPIOA_TP_CLR           (HPM_GPIO0_BASE + HPM_GPIOA_TP_CLR_OFFSET)
#define HPM_GPIOA_TP_TGL           (HPM_GPIO0_BASE + HPM_GPIOA_TP_TGL_OFFSET)
#define HPM_GPIOA_AS_VAL           (HPM_GPIO0_BASE + HPM_GPIOA_AS_VAL_OFFSET)
#define HPM_GPIOA_AS_SET           (HPM_GPIO0_BASE + HPM_GPIOA_AS_SET_OFFSET)
#define HPM_GPIOA_AS_CLR           (HPM_GPIO0_BASE + HPM_GPIOA_AS_CLR_OFFSET)
#define HPM_GPIOA_AS_TGL           (HPM_GPIO0_BASE + HPM_GPIOA_AS_TGL_OFFSET)

#define HPM_GPIOB_DI_VAL           (HPM_GPIO0_BASE + HPM_GPIOB_DI_VAL_OFFSET)
#define HPM_GPIOB_DI_SET           (HPM_GPIO0_BASE + HPM_GPIOB_DI_SET_OFFSET)
#define HPM_GPIOB_DI_CLR           (HPM_GPIO0_BASE + HPM_GPIOB_DI_CLR_OFFSET)
#define HPM_GPIOB_DI_TGL           (HPM_GPIO0_BASE + HPM_GPIOB_DI_TGL_OFFSET)
#define HPM_GPIOB_DO_VAL           (HPM_GPIO0_BASE + HPM_GPIOB_DO_VAL_OFFSET)
#define HPM_GPIOB_DO_SET           (HPM_GPIO0_BASE + HPM_GPIOB_DO_SET_OFFSET)
#define HPM_GPIOB_DO_CLR           (HPM_GPIO0_BASE + HPM_GPIOB_DO_CLR_OFFSET)
#define HPM_GPIOB_DO_TGL           (HPM_GPIO0_BASE + HPM_GPIOB_DO_TGL_OFFSET)
#define HPM_GPIOB_OE_VAL           (HPM_GPIO0_BASE + HPM_GPIOB_OE_VAL_OFFSET)
#define HPM_GPIOB_OE_SET           (HPM_GPIO0_BASE + HPM_GPIOB_OE_SET_OFFSET)
#define HPM_GPIOB_OE_CLR           (HPM_GPIO0_BASE + HPM_GPIOB_OE_CLR_OFFSET)
#define HPM_GPIOB_OE_TGL           (HPM_GPIO0_BASE + HPM_GPIOB_OE_TGL_OFFSET)
#define HPM_GPIOB_IF_VAL           (HPM_GPIO0_BASE + HPM_GPIOB_IF_VAL_OFFSET)
#define HPM_GPIOB_IF_SET           (HPM_GPIO0_BASE + HPM_GPIOB_IF_SET_OFFSET)
#define HPM_GPIOB_IF_CLR           (HPM_GPIO0_BASE + HPM_GPIOB_IF_CLR_OFFSET)
#define HPM_GPIOB_IF_TGL           (HPM_GPIO0_BASE + HPM_GPIOB_IF_TGL_OFFSET)
#define HPM_GPIOB_IE_VAL           (HPM_GPIO0_BASE + HPM_GPIOB_IE_VAL_OFFSET)
#define HPM_GPIOB_IE_SET           (HPM_GPIO0_BASE + HPM_GPIOB_IE_SET_OFFSET)
#define HPM_GPIOB_IE_CLR           (HPM_GPIO0_BASE + HPM_GPIOB_IE_CLR_OFFSET)
#define HPM_GPIOB_IE_TGL           (HPM_GPIO0_BASE + HPM_GPIOB_IE_TGL_OFFSET)
#define HPM_GPIOB_PL_VAL           (HPM_GPIO0_BASE + HPM_GPIOB_PL_VAL_OFFSET)
#define HPM_GPIOB_PL_SET           (HPM_GPIO0_BASE + HPM_GPIOB_PL_SET_OFFSET)
#define HPM_GPIOB_PL_CLR           (HPM_GPIO0_BASE + HPM_GPIOB_PL_CLR_OFFSET)
#define HPM_GPIOB_PL_TGL           (HPM_GPIO0_BASE + HPM_GPIOB_PL_TGL_OFFSET)
#define HPM_GPIOB_TP_VAL           (HPM_GPIO0_BASE + HPM_GPIOB_TP_VAL_OFFSET)
#define HPM_GPIOB_TP_SET           (HPM_GPIO0_BASE + HPM_GPIOB_TP_SET_OFFSET)
#define HPM_GPIOB_TP_CLR           (HPM_GPIO0_BASE + HPM_GPIOB_TP_CLR_OFFSET)
#define HPM_GPIOB_TP_TGL           (HPM_GPIO0_BASE + HPM_GPIOB_TP_TGL_OFFSET)
#define HPM_GPIOB_AS_VAL           (HPM_GPIO0_BASE + HPM_GPIOB_AS_VAL_OFFSET)
#define HPM_GPIOB_AS_SET           (HPM_GPIO0_BASE + HPM_GPIOB_AS_SET_OFFSET)
#define HPM_GPIOB_AS_CLR           (HPM_GPIO0_BASE + HPM_GPIOB_AS_CLR_OFFSET)
#define HPM_GPIOB_AS_TGL           (HPM_GPIO0_BASE + HPM_GPIOB_AS_TGL_OFFSET)

#define HPM_GPIOC_DI_VAL           (HPM_GPIO0_BASE + HPM_GPIOC_DI_VAL_OFFSET)
#define HPM_GPIOC_DI_SET           (HPM_GPIO0_BASE + HPM_GPIOC_DI_SET_OFFSET)
#define HPM_GPIOC_DI_CLR           (HPM_GPIO0_BASE + HPM_GPIOC_DI_CLR_OFFSET)
#define HPM_GPIOC_DI_TGL           (HPM_GPIO0_BASE + HPM_GPIOC_DI_TGL_OFFSET)
#define HPM_GPIOC_DO_VAL           (HPM_GPIO0_BASE + HPM_GPIOC_DO_VAL_OFFSET)
#define HPM_GPIOC_DO_SET           (HPM_GPIO0_BASE + HPM_GPIOC_DO_SET_OFFSET)
#define HPM_GPIOC_DO_CLR           (HPM_GPIO0_BASE + HPM_GPIOC_DO_CLR_OFFSET)
#define HPM_GPIOC_DO_TGL           (HPM_GPIO0_BASE + HPM_GPIOC_DO_TGL_OFFSET)
#define HPM_GPIOC_OE_VAL           (HPM_GPIO0_BASE + HPM_GPIOC_OE_VAL_OFFSET)
#define HPM_GPIOC_OE_SET           (HPM_GPIO0_BASE + HPM_GPIOC_OE_SET_OFFSET)
#define HPM_GPIOC_OE_CLR           (HPM_GPIO0_BASE + HPM_GPIOC_OE_CLR_OFFSET)
#define HPM_GPIOC_OE_TGL           (HPM_GPIO0_BASE + HPM_GPIOC_OE_TGL_OFFSET)
#define HPM_GPIOC_IF_VAL           (HPM_GPIO0_BASE + HPM_GPIOC_IF_VAL_OFFSET)
#define HPM_GPIOC_IF_SET           (HPM_GPIO0_BASE + HPM_GPIOC_IF_SET_OFFSET)
#define HPM_GPIOC_IF_CLR           (HPM_GPIO0_BASE + HPM_GPIOC_IF_CLR_OFFSET)
#define HPM_GPIOC_IF_TGL           (HPM_GPIO0_BASE + HPM_GPIOC_IF_TGL_OFFSET)
#define HPM_GPIOC_IE_VAL           (HPM_GPIO0_BASE + HPM_GPIOC_IE_VAL_OFFSET)
#define HPM_GPIOC_IE_SET           (HPM_GPIO0_BASE + HPM_GPIOC_IE_SET_OFFSET)
#define HPM_GPIOC_IE_CLR           (HPM_GPIO0_BASE + HPM_GPIOC_IE_CLR_OFFSET)
#define HPM_GPIOC_IE_TGL           (HPM_GPIO0_BASE + HPM_GPIOC_IE_TGL_OFFSET)
#define HPM_GPIOC_PL_VAL           (HPM_GPIO0_BASE + HPM_GPIOC_PL_VAL_OFFSET)
#define HPM_GPIOC_PL_SET           (HPM_GPIO0_BASE + HPM_GPIOC_PL_SET_OFFSET)
#define HPM_GPIOC_PL_CLR           (HPM_GPIO0_BASE + HPM_GPIOC_PL_CLR_OFFSET)
#define HPM_GPIOC_PL_TGL           (HPM_GPIO0_BASE + HPM_GPIOC_PL_TGL_OFFSET)
#define HPM_GPIOC_TP_VAL           (HPM_GPIO0_BASE + HPM_GPIOC_TP_VAL_OFFSET)
#define HPM_GPIOC_TP_SET           (HPM_GPIO0_BASE + HPM_GPIOC_TP_SET_OFFSET)
#define HPM_GPIOC_TP_CLR           (HPM_GPIO0_BASE + HPM_GPIOC_TP_CLR_OFFSET)
#define HPM_GPIOC_TP_TGL           (HPM_GPIO0_BASE + HPM_GPIOC_TP_TGL_OFFSET)
#define HPM_GPIOC_AS_VAL           (HPM_GPIO0_BASE + HPM_GPIOC_AS_VAL_OFFSET)
#define HPM_GPIOC_AS_SET           (HPM_GPIO0_BASE + HPM_GPIOC_AS_SET_OFFSET)
#define HPM_GPIOC_AS_CLR           (HPM_GPIO0_BASE + HPM_GPIOC_AS_CLR_OFFSET)
#define HPM_GPIOC_AS_TGL           (HPM_GPIO0_BASE + HPM_GPIOC_AS_TGL_OFFSET)

