apache/nuttx/arch/risc-v/src/hpm6000/hardware/hpm6300/hpm6300_gpio.h
#define HPM_GPIOX_DI_VAL           (HPM_GPIO0_BASE + HPM_GPIOX_DI_VAL_OFFSET)
#define HPM_GPIOX_DI_SET           (HPM_GPIO0_BASE + HPM_GPIOX_DI_SET_OFFSET)
#define HPM_GPIOX_DI_CLR           (HPM_GPIO0_BASE + HPM_GPIOX_DI_CLR_OFFSET)
#define HPM_GPIOX_DI_TGL           (HPM_GPIO0_BASE + HPM_GPIOX_DI_TGL_OFFSET)
#define HPM_GPIOX_DO_VAL           (HPM_GPIO0_BASE + HPM_GPIOX_DO_VAL_OFFSET)
#define HPM_GPIOX_DO_SET           (HPM_GPIO0_BASE + HPM_GPIOX_DO_SET_OFFSET)
#define HPM_GPIOX_DO_CLR           (HPM_GPIO0_BASE + HPM_GPIOX_DO_CLR_OFFSET)
#define HPM_GPIOX_DO_TGL           (HPM_GPIO0_BASE + HPM_GPIOX_DO_TGL_OFFSET)
#define HPM_GPIOX_OE_VAL           (HPM_GPIO0_BASE + HPM_GPIOX_OE_VAL_OFFSET)
#define HPM_GPIOX_OE_SET           (HPM_GPIO0_BASE + HPM_GPIOX_OE_SET_OFFSET)
#define HPM_GPIOX_OE_CLR           (HPM_GPIO0_BASE + HPM_GPIOX_OE_CLR_OFFSET)
#define HPM_GPIOX_OE_TGL           (HPM_GPIO0_BASE + HPM_GPIOX_OE_TGL_OFFSET)
#define HPM_GPIOX_IF_VAL           (HPM_GPIO0_BASE + HPM_GPIOX_IF_VAL_OFFSET)
#define HPM_GPIOX_IF_SET           (HPM_GPIO0_BASE + HPM_GPIOX_IF_SET_OFFSET)
#define HPM_GPIOX_IF_CLR           (HPM_GPIO0_BASE + HPM_GPIOX_IF_CLR_OFFSET)
#define HPM_GPIOX_IF_TGL           (HPM_GPIO0_BASE + HPM_GPIOX_IF_TGL_OFFSET)
#define HPM_GPIOX_IE_VAL           (HPM_GPIO0_BASE + HPM_GPIOX_IE_VAL_OFFSET)
#define HPM_GPIOX_IE_SET           (HPM_GPIO0_BASE + HPM_GPIOX_IE_SET_OFFSET)
#define HPM_GPIOX_IE_CLR           (HPM_GPIO0_BASE + HPM_GPIOX_IE_CLR_OFFSET)
#define HPM_GPIOX_IE_TGL           (HPM_GPIO0_BASE + HPM_GPIOX_IE_TGL_OFFSET)
#define HPM_GPIOX_PL_VAL           (HPM_GPIO0_BASE + HPM_GPIOX_PL_VAL_OFFSET)
#define HPM_GPIOX_PL_SET           (HPM_GPIO0_BASE + HPM_GPIOX_PL_SET_OFFSET)
#define HPM_GPIOX_PL_CLR           (HPM_GPIO0_BASE + HPM_GPIOX_PL_CLR_OFFSET)
#define HPM_GPIOX_PL_TGL           (HPM_GPIO0_BASE + HPM_GPIOX_PL_TGL_OFFSET)
#define HPM_GPIOX_TP_VAL           (HPM_GPIO0_BASE + HPM_GPIOX_TP_VAL_OFFSET)
#define HPM_GPIOX_TP_SET           (HPM_GPIO0_BASE + HPM_GPIOX_TP_SET_OFFSET)
#define HPM_GPIOX_TP_CLR           (HPM_GPIO0_BASE + HPM_GPIOX_TP_CLR_OFFSET)
#define HPM_GPIOX_TP_TGL           (HPM_GPIO0_BASE + HPM_GPIOX_TP_TGL_OFFSET)
#define HPM_GPIOX_AS_VAL           (HPM_GPIO0_BASE + HPM_GPIOX_AS_VAL_OFFSET)
#define HPM_GPIOX_AS_SET           (HPM_GPIO0_BASE + HPM_GPIOX_AS_SET_OFFSET)
#define HPM_GPIOX_AS_CLR           (HPM_GPIO0_BASE + HPM_GPIOX_AS_CLR_OFFSET)
#define HPM_GPIOX_AS_TGL           (HPM_GPIO0_BASE + HPM_GPIOX_AS_TGL_OFFSET)

#define HPM_GPIOY_DI_VAL           (HPM_GPIO0_BASE + HPM_GPIOY_DI_VAL_OFFSET)
#define HPM_GPIOY_DI_SET           (HPM_GPIO0_BASE + HPM_GPIOY_DI_SET_OFFSET)
#define HPM_GPIOY_DI_CLR           (HPM_GPIO0_BASE + HPM_GPIOY_DI_CLR_OFFSET)
#define HPM_GPIOY_DI_TGL           (HPM_GPIO0_BASE + HPM_GPIOY_DI_TGL_OFFSET)
#define HPM_GPIOY_DO_VAL           (HPM_GPIO0_BASE + HPM_GPIOY_DO_VAL_OFFSET)
#define HPM_GPIOY_DO_SET           (HPM_GPIO0_BASE + HPM_GPIOY_DO_SET_OFFSET)
#define HPM_GPIOY_DO_CLR           (HPM_GPIO0_BASE + HPM_GPIOY_DO_CLR_OFFSET)
#define HPM_GPIOY_DO_TGL           (HPM_GPIO0_BASE + HPM_GPIOY_DO_TGL_OFFSET)
#define HPM_GPIOY_OE_VAL           (HPM_GPIO0_BASE + HPM_GPIOY_OE_VAL_OFFSET)
#define HPM_GPIOY_OE_SET           (HPM_GPIO0_BASE + HPM_GPIOY_OE_SET_OFFSET)
#define HPM_GPIOY_OE_CLR           (HPM_GPIO0_BASE + HPM_GPIOY_OE_CLR_OFFSET)
#define HPM_GPIOY_OE_TGL           (HPM_GPIO0_BASE + HPM_GPIOY_OE_TGL_OFFSET)
#define HPM_GPIOY_IF_VAL           (HPM_GPIO0_BASE + HPM_GPIOY_IF_VAL_OFFSET)
#define HPM_GPIOY_IF_SET           (HPM_GPIO0_BASE + HPM_GPIOY_IF_SET_OFFSET)
#define HPM_GPIOY_IF_CLR           (HPM_GPIO0_BASE + HPM_GPIOY_IF_CLR_OFFSET)
#define HPM_GPIOY_IF_TGL           (HPM_GPIO0_BASE + HPM_GPIOY_IF_TGL_OFFSET)
#define HPM_GPIOY_IE_VAL           (HPM_GPIO0_BASE + HPM_GPIOY_IE_VAL_OFFSET)
#define HPM_GPIOY_IE_SET           (HPM_GPIO0_BASE + HPM_GPIOY_IE_SET_OFFSET)
#define HPM_GPIOY_IE_CLR           (HPM_GPIO0_BASE + HPM_GPIOY_IE_CLR_OFFSET)
#define HPM_GPIOY_IE_TGL           (HPM_GPIO0_BASE + HPM_GPIOY_IE_TGL_OFFSET)
#define HPM_GPIOY_PL_VAL           (HPM_GPIO0_BASE + HPM_GPIOY_PL_VAL_OFFSET)
#define HPM_GPIOY_PL_SET           (HPM_GPIO0_BASE + HPM_GPIOY_PL_SET_OFFSET)
#define HPM_GPIOY_PL_CLR           (HPM_GPIO0_BASE + HPM_GPIOY_PL_CLR_OFFSET)
#define HPM_GPIOY_PL_TGL           (HPM_GPIO0_BASE + HPM_GPIOY_PL_TGL_OFFSET)
#define HPM_GPIOY_TP_VAL           (HPM_GPIO0_BASE + HPM_GPIOY_TP_VAL_OFFSET)
#define HPM_GPIOY_TP_SET           (HPM_GPIO0_BASE + HPM_GPIOY_TP_SET_OFFSET)
#define HPM_GPIOY_TP_CLR           (HPM_GPIO0_BASE + HPM_GPIOY_TP_CLR_OFFSET)
#define HPM_GPIOY_TP_TGL           (HPM_GPIO0_BASE + HPM_GPIOY_TP_TGL_OFFSET)
#define HPM_GPIOY_AS_VAL           (HPM_GPIO0_BASE + HPM_GPIOY_AS_VAL_OFFSET)
#define HPM_GPIOY_AS_SET           (HPM_GPIO0_BASE + HPM_GPIOY_AS_SET_OFFSET)
#define HPM_GPIOY_AS_CLR           (HPM_GPIO0_BASE + HPM_GPIOY_AS_CLR_OFFSET)
#define HPM_GPIOY_AS_TGL           (HPM_GPIO0_BASE + HPM_GPIOY_AS_TGL_OFFSET)

#define HPM_GPIOZ_DI_VAL           (HPM_GPIO0_BASE + HPM_GPIOZ_DI_VAL_OFFSET)
#define HPM_GPIOZ_DI_SET           (HPM_GPIO0_BASE + HPM_GPIOZ_DI_SET_OFFSET)
#define HPM_GPIOZ_DI_CLR           (HPM_GPIO0_BASE + HPM_GPIOZ_DI_CLR_OFFSET)
#define HPM_GPIOZ_DI_TGL           (HPM_GPIO0_BASE + HPM_GPIOZ_DI_TGL_OFFSET)
#define HPM_GPIOZ_DO_VAL           (HPM_GPIO0_BASE + HPM_GPIOZ_DO_VAL_OFFSET)
#define HPM_GPIOZ_DO_SET           (HPM_GPIO0_BASE + HPM_GPIOZ_DO_SET_OFFSET)
#define HPM_GPIOZ_DO_CLR           (HPM_GPIO0_BASE + HPM_GPIOZ_DO_CLR_OFFSET)
#define HPM_GPIOZ_DO_TGL           (HPM_GPIO0_BASE + HPM_GPIOZ_DO_TGL_OFFSET)
#define HPM_GPIOZ_OE_VAL           (HPM_GPIO0_BASE + HPM_GPIOZ_OE_VAL_OFFSET)
#define HPM_GPIOZ_OE_SET           (HPM_GPIO0_BASE + HPM_GPIOZ_OE_SET_OFFSET)
#define HPM_GPIOZ_OE_CLR           (HPM_GPIO0_BASE + HPM_GPIOZ_OE_CLR_OFFSET)
#define HPM_GPIOZ_OE_TGL           (HPM_GPIO0_BASE + HPM_GPIOZ_OE_TGL_OFFSET)
#define HPM_GPIOZ_IF_VAL           (HPM_GPIO0_BASE + HPM_GPIOZ_IF_VAL_OFFSET)
#define HPM_GPIOZ_IF_SET           (HPM_GPIO0_BASE + HPM_GPIOZ_IF_SET_OFFSET)
#define HPM_GPIOZ_IF_CLR           (HPM_GPIO0_BASE + HPM_GPIOZ_IF_CLR_OFFSET)
#define HPM_GPIOZ_IF_TGL           (HPM_GPIO0_BASE + HPM_GPIOZ_IF_TGL_OFFSET)
#define HPM_GPIOZ_IE_VAL           (HPM_GPIO0_BASE + HPM_GPIOZ_IE_VAL_OFFSET)
#define HPM_GPIOZ_IE_SET           (HPM_GPIO0_BASE + HPM_GPIOZ_IE_SET_OFFSET)
#define HPM_GPIOZ_IE_CLR           (HPM_GPIO0_BASE + HPM_GPIOZ_IE_CLR_OFFSET)
#define HPM_GPIOZ_IE_TGL           (HPM_GPIO0_BASE + HPM_GPIOZ_IE_TGL_OFFSET)
#define HPM_GPIOZ_PL_VAL           (HPM_GPIO0_BASE + HPM_GPIOZ_PL_VAL_OFFSET)
#define HPM_GPIOZ_PL_SET           (HPM_GPIO0_BASE + HPM_GPIOZ_PL_SET_OFFSET)
#define HPM_GPIOZ_PL_CLR           (HPM_GPIO0_BASE + HPM_GPIOZ_PL_CLR_OFFSET)
#define HPM_GPIOZ_PL_TGL           (HPM_GPIO0_BASE + HPM_GPIOZ_PL_TGL_OFFSET)
#define HPM_GPIOZ_TP_VAL           (HPM_GPIO0_BASE + HPM_GPIOZ_TP_VAL_OFFSET)
#define HPM_GPIOZ_TP_SET           (HPM_GPIO0_BASE + HPM_GPIOZ_TP_SET_OFFSET)
#define HPM_GPIOZ_TP_CLR           (HPM_GPIO0_BASE + HPM_GPIOZ_TP_CLR_OFFSET)
#define HPM_GPIOZ_TP_TGL           (HPM_GPIO0_BASE + HPM_GPIOZ_TP_TGL_OFFSET)
#define HPM_GPIOZ_AS_VAL           (HPM_GPIO0_BASE + HPM_GPIOZ_AS_VAL_OFFSET)
#define HPM_GPIOZ_AS_SET           (HPM_GPIO0_BASE + HPM_GPIOZ_AS_SET_OFFSET)
#define HPM_GPIOZ_AS_CLR           (HPM_GPIO0_BASE + HPM_GPIOZ_AS_CLR_OFFSET)
#define HPM_GPIOZ_AS_TGL           (HPM_GPIO0_BASE + HPM_GPIOZ_AS_TGL_OFFSET)

#endif /* __ARCH_RISCV_SRC_HPM6000_HARDWARE_HPM6300_HPM6300_GPIO_H */
